TerryFogg/nfNative/Targets/ST_STM32H7B3I-DK/STM32H7B3_DK_nanoBooter/stm32h7xx_Usart.h
#pragma once

#include "stm32h7b3xxq.h"


#define CHECK_BIT(REGISTER,BIT_POSITION)  (REGISTER & BIT_POSITION)

#define USART_RESET(USART)  USART->CR1 = 0; USART->CR2 = 0; USART->CR3 = 0

/*
Bit 0 UE: USART enable
    When this bit is cleared, the USART prescalers and outputs are stopped immediately, and all 
    current operations are discarded.The USART configuration is kept, but all the USART_ISR 
    status flags are reset.This bit is set and cleared by software.
    0 : USART prescaler and outputs disabled, low - power mode
    1 : USART enabled
*/    
#define USART_DISABLE(USART)  CLEAR_BIT(USART->CR1, USART_CR1_UE_Pos)
#define USART_ENABLE(USART)   SET_BIT  (USART->CR1, USART_CR1_UE_Pos)

/*
Bit 1 UESM: USART enable in low-power mode 
    When this bit is cleared, the USART cannot wake up the MCU from low-power mode.
    When this bit is set, the USART can wake up the MCU from low-power mode.
    This bit is set and cleared by software.
    0: USART not able to wake up the MCU from low-power mode.
    1: USART able to wake up the MCU from low-power mode
*/
#define USART_LOW_POWER_DISABLE(USART)  CLEAR_BIT(USART->CR1, USART_CR1_UESM_Pos)
#define USART_LOW_POWER_ENABLE(USART)   SET_BIT  (USART->CR1, USART_CR1_UESM_Pos)
 
/*
Bit 2 RE: Receiver enable
    This bit enables the receiver. It is set and cleared by software.
    0: Receiver is disabled
    1: Receiver is enabled and begins searching for a start bit
 */
#define USART_RECEIVER_DISABLE(USART)  CLEAR_BIT(USART->CR1, USART_CR1_RE_Pos)    
#define USART_RECEIVER_ENABLE(USART)   SET_BIT  (USART->CR1, USART_CR1_RE_Pos)    

/*
Bit 3 TE: Transmitter enable
    This bit enables the transmitter. It is set and cleared by software.
    0: Transmitter is disabled
    1: Transmitter is enabled
 */
#define USART_TRANSMITTER_DISABLE(USART)  CLEAR_BIT(USART->CR1, USART_CR1_TE_Pos) 
#define USART_TRANSMITTER_ENABLE(USART)   SET_BIT  (USART->CR1, USART_CR1_TE_Pos)

/*
Bit 4 IDLEIE: IDLE interrupt enable
    This bit is set and cleared by software.
    0: Interrupt inhibited
    1: USART interrupt generated whenever IDLE = 1 in the USART_ISR register
 */
#define USART_IDLE_INTERRUPT_DISABLE(USART)  CLEAR_BIT(USART->CR1, USART_CR1_IDLEIE_Pos)
#define USART_IDLE_INTERRUPT_ENABLE(USART)   SET_BIT  (USART->CR1, USART_CR1_IDLEIE_Pos)

/*
Bit 5 RXFNEIE: RXFIFO not empty interrupt enable
    This bit is set and cleared by software.
        0: Interrupt inhibited
        1: USART interrupt generated whenever ORE = 1 or RXFNE = 1 in the USART_ISR register
 */
#define USART_DISABLE_RXNE_RX_FIFO_INTERRUPT_DISABLE(USART) CLEAR_BIT(USART->CR1, USART_CR1_RXNEIE_RXFNEIE_Pos) 
#define USART_ENABLE_RXNE_RX_FIFO_INTERRUPT_ENABLE(USART)   SET_BIT  (USART->CR1, USART_CR1_RXNEIE_RXFNEIE_Pos)
/*
Bit 6 TCIE: Transmission complete interrupt enable
    This bit is set and cleared by software.
        0: Interrupt inhibited
        1: USART interrupt generated whenever TC = 1 in the USART_ISR register
*/
#define USART_TX_COMPLETE_INTERRUPT_DISABLE(USART)  CLEAR_BIT(USART->CR1, USART_CR1_TCIE_Pos) 
#define USART_TX_COMPLETE_INTERRUPT_ENABLE(USART)   SET_BIT  (USART->CR1, USART_CR1_TCIE_Pos)
/*
Bit 7 TXFNFIE: TXFIFO not full interrupt enable
    This bit is set and cleared by software.
        0: Interrupt inhibited
        1: USART interrupt generated whenever TXFNF =1 in the USART_ISR register
*/                                                                
#define USART_TX_TXE_FIFO_COMPLETE_INTERRUPT_DISABLE(USART)  CLEAR_BIT(USART->CR1, USART_CR1_TXEIE_TXFNFIE_Pos) 
#define USART_TX_TXE_FIFO_COMPLETE_INTERRUPT_ENABLE(USART)   SET_BIT  (USART->CR1, USART_CR1_TXEIE_TXFNFIE_Pos)
/*
Bit 8 PEIE: PE interrupt enable
    This bit is set and cleared by software.
        0: Interrupt inhibited
        1: USART interrupt generated whenever PE = 1 in the USART_ISR register
*/
#define USART_PARITY_INTERRUPT_DISABLE(USART)  CLEAR_BIT(USART->CR1, USART_CR1_PEIE_Pos) 
#define USART_PARITY_INTERRUPT_ENABLE(USART)   SET_BIT  (USART->CR1, USART_CR1_PEIE_Pos)
      
/*
Bit 9 PS: Parity selection
    This bit selects the odd or even parity when the parity generation/detection is enabled (PCE 
    bit set). It is set and cleared by software. The parity is selected after the current byte.
        0: Even parity
        1: Odd parity
    This bitfield can only be written when the USART is disabled (UE = 0).*/

#define USART_PARITY_EVEN(USART) CLEAR_BIT(USART->CR1, USART_CR1_PS_Pos)
#define USART_PARITY_ODD(USART)  SET_BIT  (USART->CR1, USART_CR1_PS_Pos)   
/*
Bit 10 PCE: Parity control enable
    This bit selects the hardware parity control (generation and detection). When the parity 
    control is enabled, the computed parity is inserted at the MSB position (9th bit if M = 1; 8th bit 
    if M = 0) and the parity is checked on the received data. This bit is set and cleared by 
    software. Once it is set, PCE is active after the current byte (in reception and in 
    transmission).
        0: Parity control disabled
        1: Parity control enabled
    This bitfield can only be written when the USART is disabled (UE = 0).
*/                                                                
#define USART_PARITY_NONE(USART)     CLEAR_BIT(USART->CR1, USART_CR1_PCE_Pos)
#define USART_PARITY_ENABLED(USART)  SET_BIT  (USART->CR1, USART_CR1_PCE_Pos)  
/*
Bit 11 WAKE : Receiver wakeup method
    This bit determines the USART wakeup method from Mute mode.It is set or cleared by 
    software.
        0 : Idle line
        1 : Address mark
    This bitfield can only be written when the USART is disabled(UE = 0).
*/                                                                
#define USART_RECEIVER_WAKE_IDLE(USART)     CLEAR_BIT(USART->CR1, USART_CR1_WAKE_Pos)
#define USART_RECEIVER_WAKE_ADDRESS(USART)  SET_BIT  (USART->CR1, USART_CR1_WAKE_Pos)
/*
Bit 12 M0: Word length
Bit 28 M1: Word length
    M[1:0] = ‘10’: 1 start bit, 7 Data bits, n Stop bit
    M[1:0] = ‘00’: 1 start bit, 8 Data bits, n Stop bit
    M[1:0] = ‘01’: 1 start bit, 9 Data bits, n Stop bit
        This bit can only be written when the USART is disabled (UE = 0)
*/
#define USART_7_BIT_WORD_LENGTH(USART)   SET_BIT  (USART->CR1, USART_CR1_M1_Pos); CLEAR_BIT(USART->CR1, USART_CR1_M_Pos);
#define USART_8_BIT_WORD_LENGTH(USART)   CLEAR_BIT(USART->CR1, USART_CR1_M1_Pos); CLEAR_BIT(USART->CR1, USART_CR1_M_Pos);
#define USART_9_BIT_WORD_LENGTH(USART)   CLEAR_BIT(USART->CR1, USART_CR1_M1_Pos); SET_BIT  (USART->CR1, USART_CR1_M_Pos);
/*
Bit 13 MME : Mute mode enable
    This bit enables the USART Mute mode function.When set, the USART can switch between 
    active and Mute mode, as defined by the WAKE bit.It is set and cleared by software.
        0 : Receiver in active mode permanently
        1 : Receiver can switch between Mute mode and active mode
*/
#define USART_MUTE_MODE_DISABLE(USART)  CLEAR_BIT(USART->CR1, USART_CR1_MME_Pos);        
#define USART_MUTE_MODE_ENABLE(USART)   SET_BIT  (USART->CR1, USART_CR1_MME_Pos);
/*
Bit 14 CMIE: Character match interrupt enable
    This bit is set and cleared by software.
        0: Interrupt inhibited
        1: USART interrupt generated when the CMF bit is set in the USART_ISR register.
*/                                                                                                                   
#define USART_MATCH_DISABLE(USART)  CLEAR_BIT(USART->CR1, USART_CR1_CMIE_Pos);       
#define USART_MATCH_ENABLE(USART)   SET_BIT  (USART->CR1, USART_CR1_CMIE_Pos);
/*
Bit 15 OVER8: Oversampling mode
    0: Oversampling by 16
    1: Oversampling by 8
This bit can only be written when the USART is disabled (UE = 0).
Note: In LIN, IrDA and Smartcard modes, this bit must be kept cleared. 
*/                                                                                                                   
#define USART_OVERSAMPLING_16(USART) CLEAR_BIT(USART->CR1, USART_CR1_OVER8_Pos);      
#define USART_OVERSAMPLING_8(USART)  SET_BIT  (USART->CR1, USART_CR1_OVER8_Pos);
 
