TerryFogg/nfNative/Targets/ST_STM32H7B3I-DK/STM32H7B3_DK_nanoBooter/stm32h7xx_Usart.h
/*
Bits 20 : 16 DEDT[4 : 0] : Driver Enable deassertion time
    This 5 - bit value defines the time between the end of the last stop bit, in a transmitted 
    message, and the de - activation of the DE(Driver Enable) signal.It is expressed in sample 
    time units(1 / 8 or 1 / 16 bit time, depending on the oversampling rate).
    If the USART_TDR register is written during the DEDT time, the new data is transmitted only 
    when the DEDT and DEAT times have both elapsed.
    This bitfield can only be written when the USART is disabled(UE = 0).
        Note : If the Driver Enable feature is not supported, this bit is reserved and
*/    
    
/* ------------DEDT[4 : 0] = ?*/

/*
Bit 26 RTOIE: Receiver timeout interrupt enable
    This bit is set and cleared by software.
        0: Interrupt inhibited
        1: USART interrupt generated when the RTOF bit is set in the USART_ISR register.
            Note: If the USART does not support the Receiver timeout feature, this bit is reserved and 
            must be kept at reset value.
*/
#define USART_RECEIVER_TIMEOUT_INT_DISABLE(USART) CLEAR_BIT(USART->CR1, USART_CR1_RTOIE_Pos);      
#define USART_RECEIVER_TIMEOUT_INT_ENABLE(USART)  SET_BIT  (USART->CR1, USART_CR1_RTOIE_Pos);
/*
 *Bit 27 EOBIE: End of Block interrupt enable
    This bit is set and cleared by software.
        0: Interrupt inhibited
        1: USART interrupt generated when the EOBF flag is set in the USART_ISR register
            Note: If the USART does not support Smartcard mode, this bit is reserved and must be kept at 
            reset value*/                                                                                                                   
#define USART_END_OF_BLOCK_INT_ENABLE(USART)  SET_BIT  (USART->CR1, USART_CR1_EOBIE_Pos);
#define USART_END_OF_BLOCK_INT_DISABLE(USART) CLEAR_BIT(USART->CR1, USART_CR1_EOBIE_Pos);      
/*
Bit 29 FIFOEN: FIFO mode enable
    This bit is set and cleared by software.
        0: FIFO mode is disabled.
        1: FIFO mode is enabled.
            This bitfield can only be written when the USART is disabled (UE = 0).
            Note: FIFO mode can be used on standard UART communication, in SPI master/slave mode 
            and in Smartcard modes only. It must not be enabled in IrDA and LIN modes.
*/                                                                                                                  
#define USART_FIFO_DISABLE(USART)  CLEAR_BIT(USART->CR1, USART_CR1_FIFOEN_Pos);     
#define USART_FIFO_ENABLE(USART)   SET_BIT  (USART->CR1, USART_CR1_FIFOEN_Pos);
/*
Bit 30 TXFEIE: TXFIFO empty interrupt enable
    This bit is set and cleared by software.
        0: Interrupt inhibited
        1: USART interrupt generated when TXFE = 1 in the USART_ISR register
*/                                                                                                                   
#define USART_TXFIFO_ENABLE(USART)  SET_BIT  (USART->CR1, USART_CR1_TXFEIE_Pos);
#define USART_TXFIFO_DISABLE(USART) CLEAR_BIT(USART->CR1, USART_CR1_TXFEIE_Pos);     
/*
Bit 31 RXFFIE: RXFIFO Full interrupt enable
    This bit is set and cleared by software.
        0: Interrupt inhibited
        1: USART interrupt generated when RXFF = 1 in the USART_ISR register
*/                                                                                                                   
#define USART_RXFIFO_DISABLE(USART) CLEAR_BIT(USART->CR1, USART_CR1_RXFFIE_Pos);     
#define USART_RXFIFO_ENABLE(USART)  SET_BIT  (USART->CR1, USART_CR1_RXFFIE_Pos);
/*
Bit 0 SLVEN: Synchronous Slave mode enable
    When the SLVEN bit is set, the synchronous slave mode is enabled.
        0: Slave mode disabled.
        1: Slave mode enabled.
*/                                                                                                                   
#define USART_SYNCH_SLAVE_DISABLE(USART) CLEAR_BIT(USART->CR2, USART_CR2_SLVEN_Pos);      
#define USART_SYNCH_SLAVE_ENABLE(USART)  SET_BIT  (USART->CR2, USART_CR2_SLVEN_Pos);
/*
Bit 3 DIS_NSS:
    When the DIS_NSS bit is set, the NSS pin input is ignored.
        0: SPI slave selection depends on NSS input pin.
        1: SPI slave is always selected and NSS input pin is ignored      
*/                                                                                                                   
#define USART_NSS_SPI_SLAVE_SELECTION(USART) SET_BIT  (USART->CR2, USART_CR2_DIS_NSS_Pos);
#define USART_NSS_SPI_SLAVE_ALWAYS(USART)    CLEAR_BIT(USART->CR2, USART_CR2_DIS_NSS_Pos);    
/*
Bit 4 ADDM7: 7-bit Address Detection/4-bit Address Detection
    This bit is for selection between 4-bit address detection or 7-bit address detection. 
        0: 4-bit address detection
        1: 7-bit address detection (in 8-bit data mode)
            This bit can only be written when the USART is disabled (UE = 0)
            Note: In 7-bit and 9-bit data modes, the address detection is done on 6-bit and 8-bit address 
            (ADD[5:0] and ADD[7:0]) respectively
*/                                                                                                                   
#define USART_ADDRESS_DETECT_4BIT(USART)  SET_BIT  (USART->CR2, USART_CR2_ADDM7_Pos);
#define USART_ADDRESS_DETECT_7BIT(USART)  CLEAR_BIT(USART->CR2, USART_CR2_ADDM7_Pos);      
/*
Bit 5 LBDL: LIN break detection length
    This bit is for selection between 11 bit or 10 bit break detection.
        0: 10-bit break detection
        1: 11-bit break detection
            This bit can only be written when the USART is disabled (UE = 0).
*/                                                                                                                   
#define LIN_BREAK_DETECT_10BIT(USART)  CLEAR_BIT(USART->CR2, USART_CR2_LBDL_Pos);       
#define LIN_BREAK_DETECT_11BIT(USART)  SET_BIT  (USART->CR2, USART_CR2_LBDL_Pos);
/*
Bit 6 LBDIE: LIN break detection interrupt enable
    Break interrupt mask (break detection using break delimiter).
        0: Interrupt is inhibited
        1: An interrupt is generated whenever LBDF = 1 in the USART_ISR register
*/                                                                                                                   
#define LIN_BREAK_DETECT_INTERRUPT_DISABLE(USART)  CLEAR_BIT(USART->CR2, USART_CR2_LBDIE_Pos);      
#define LIN_BREAK_DETECT_INTERRUPT_ENABLE(USART)   SET_BIT  (USART->CR2, USART_CR2_LBDIE_Pos);
/*
Bit 7 Reserved, must be kept at reset value
*/
/* ---------  */
/*
Bit 8 LBCL: Last bit clock pulse
    This bit is used to select whether the clock pulse associated with the last data bit transmitted (MSB) 
    has to be output on the SCLK pin in synchronous mode. 
        0: The clock pulse of the last data bit is not output to the SCLK pin
        1: The clock pulse of the last data bit is output to the SCLK pin
            Caution: The last bit is the 7th or 8th or 9th data bit transmitted depending on the 7 or 8 or 9 bit 
            format selected by the M bit in the USART_CR1 register.
            This bit can only be written when the USART is disabled (UE = 0)
 */
#define USART_LAST_BIT_CLOCK_PULSE_EXCLUDE(USART)  CLEAR_BIT(USART->CR2, USART_CR2_LBCL_Pos);       
#define USART_LAST_BIT_CLOCK_PULSE_PRESENT(USART)  SET_BIT  (USART->CR2, USART_CR2_LBCL_Pos);
/*
Bit 9 CPHA: Clock phase
    This bit is used to select the phase of the clock output on the SCLK pin in synchronous mode. It 
    works in conjunction with the CPOL bit to produce the desired clock/data relationship (see 
    Figure 544 and Figure 545)
        0: The first clock transition is the first data capture edge
        1: The second clock transition is the first data capture edge
        This bit can only be written when the USART is disabled (UE = 0).
*/                                                                                         
#define USART_CLOCK_PHASE_FIRST(USART)   SET_BIT  (USART->CR2, USART_CR2_LBCL_Pos);
#define USART_CLOCK_PHASE_SECOND(USART)  CLEAR_BIT(USART->CR2, USART_CR2_CPHA_Pos);       
/*
Bit 10 CPOL: Clock polarity
    This bit enables the user to select the polarity of the clock output on the SCLK pin in synchronous 
    mode. It works in conjunction with the CPHA bit to produce the desired clock/data relationship 
        0: Steady low value on SCLK pin outside transmission window
        1: Steady high value on SCLK pin outside transmission window
        This bit can only be written when the USART is disabled (UE = 0)
*/
#define USART_CLOCK_POLARITY_LOW(USART)  CLEAR_BIT(USART->CR2, USART_CR2_CPOL_Pos);
#define USART_CLOCK_POLARITY_HIGH(USART) SET_BIT  (USART->CR2, USART_CR2_CPOL_Pos);
/*
Bit 11 CLKEN: Clock enable
    This bit enables the user to enable the SCLK pin.
        0: SCLK pin disabled
        1: SCLK pin enabled
        This bit can only be written when the USART is disabled (UE = 0).
        Note: If neither synchronous mode nor Smartcard mode is supported, this bit is reserved and must 
        be kept at reset value. Refer to Section 53.4: USART implementation on page 1958.
        In Smartcard mode, in order to provide correctly the SCLK clock to the smartcard, the steps 
        below must be respected:
            UE = 0
            SCEN = 1
            GTPR configuration
            CLKEN= 1
            UE = 1
*/                                                                
#define USART_SCLK_DISABLE(USART) CLEAR_BIT(USART->CR2, USART_CR2_CLKEN_Pos);  
#define USART_SCLK_ENABLE(USART)  SET_BIT  (USART->CR2, USART_CR2_CLKEN_Pos);
/*
Bits 13:12 STOP[1:0]: stop bits
    These bits are used for programming the stop bits.
    00: 1 stop bit
    01: 0.5 stop bit.
    10: 2 stop bits
    11: 1.5 stop bits
        This bitfield can only be written when the USART is disabled (UE = 0)
*/
#define USART_STOP_1_BITS(USART)    CLEAR_BIT(USART->CR2, USART_CR2_STOP_Pos+1);CLEAR_BIT(USART->CR2, USART_CR2_STOP_Pos);      
#define USART_STOP_0_5_BITS(USART)  CLEAR_BIT(USART->CR2, USART_CR2_STOP_Pos+1);SET_BIT  (USART->CR2, USART_CR2_STOP_Pos);      
#define USART_STOP_2_BITS(USART)    SET_BIT  (USART->CR2, USART_CR2_STOP_Pos+1);CLEAR_BIT(USART->CR2, USART_CR2_STOP_Pos);     
#define USART_STOP_1_5_BITS(USART)  SET_BIT  (USART->CR2, USART_CR2_STOP_Pos+1);SET_BIT  (USART->CR2, USART_CR2_STOP_Pos);     
/*
Bit 14 LINEN: LIN mode enable
    This bit is set and cleared by software.
        0: LIN mode disabled
        1: LIN mode enabled
        The LIN mode enables the capability to send LIN synchronous breaks (13 low bits) using the 
        SBKRQ bit in the USART_CR1 register, and to detect LIN Sync breaks.
        This bitfield can only be written when the USART is disabled (UE = 0).
*/
#define LIN_MODE_DISABLE(USART)  CLEAR_BIT(USART->CR2, USART_CR2_LINEN_Pos);      
#define LIN_MODE_ENABLE(USART)   SET_BIT  (USART->CR2, USART_CR2_LINEN_Pos);
/*
Bit 15 SWAP: Swap TX/RX pins
This bit is set and cleared by software.
    0: TX/RX pins are used as defined in standard pinout
    1: The TX and RX pins functions are swapped. This enables to work in the case of a cross-wired 
    connection to another UART. 
    This bitfield can only be written when the USART is disabled (UE = 0).
*/                                                                                                                  
#define USART_TX_PIN_STANDARD(USART) CLEAR_BIT(USART->CR2, USART_CR2_SWAP_Pos);      
#define USART_TX_RX_PIN_SWAP(USART)  SET_BIT  (USART->CR2, USART_CR2_SWAP_Pos);
/*
Bit 16 RXINV: RX pin active level inversion
    This bit is set and cleared by software.
        0: RX pin signal works using the standard logic levels (VDD =1/idle, Gnd = 0/mark) 
        1: RX pin signal values are inverted (VDD =0/mark, Gnd = 1/idle). 
        This enables the use of an external inverter on the RX line. 
        This bitfield can only be written when the USART is disabled (UE = 0)     
*/                                                                                                                  
#define USART_RX_ACTIVE_LEVEL_STANDARD(USART)  CLEAR_BIT(USART->CR2, USART_CR2_RXINV_Pos);     
#define USART_RX_ACTIVE_LEVEL_INVERTED(USART)  SET_BIT  (USART->CR2, USART_CR2_RXINV_Pos);
/*
Bit 17 TXINV: TX pin active level inversion
    This bit is set and cleared by software.
        0: TX pin signal works using the standard logic levels (VDD =1/idle, Gnd = 0/mark) 
        1: TX pin signal values are inverted (VDD =0/mark, Gnd = 1/idle). 
        This enables the use of an external inverter on the TX line. 
        This bitfield can only be written when the USART is disabled (UE = 0)
*/                                                                                                                  
#define USART_TX_ACTIVE_LEVEL_NORMAL(USART)    CLEAR_BIT(USART->CR2, USART_CR2_TXINV_Pos);     
#define USART_TX_ACTIVE_LEVEL_INVERTED(USART)  SET_BIT  (USART->CR2, USART_CR2_TXINV_Pos);
/*
Bit 18 DATAINV: Binary data inversion
    This bit is set and cleared by software.
        0: Logical data from the data register are send/received in positive/direct logic. (1 = H, 0 = L) 
        1: Logical data from the data register are send/received in negative/inverse logic. (1 = L, 0 = H). 
        The parity bit is also inverted.
        This bitfield can only be written when the USART is disabled (UE = 0).
*/                                                                                                                  
#define USART_BINARY_DATA_NORMAL(USART)    CLEAR_BIT(USART->CR2, USART_CR2_DATAINV_Pos);     
#define USART_BINARY_DATA_INVERTED(USART)  SET_BIT  (USART->CR2, USART_CR2_DATAINV_Pos);
/*
Bit 19 MSBFIRST: Most significant bit first
    This bit is set and cleared by software.
    0: data is transmitted/received with data bit 0 first, following the start bit. 
    1: data is transmitted/received with the MSB (bit 7/8) first, following the start bit. 
    This bitfield can only be written when the USART is disabled (UE = 0)
*/                                                                                                 
#define USART_MSB_BIT_FIRST(USART)  CLEAR_BIT(USART->CR2, USART_CR2_MSBFIRST_Pos);     
#define USART_LSB_BIT_FIRST(USART)  SET_BIT  (USART->CR2, USART_CR2_MSBFIRST_Pos);
/*
Bit 20 ABREN: Auto baud rate enable
    This bit is set and cleared by software.
        0: Auto baud rate detection is disabled. 
        1: Auto baud rate detection is enabled. 
        Note: If the USART does not support the auto baud rate feature, this bit is reserved and must be kept 
        at reset value. R
*/                                                                                                 
#define USART_AUTOBAUD_DISABLE(USART)  CLEAR_BIT(USART->CR2, USART_CR2_ABREN_Pos);    
#define USART_AUTOBAUD_ENABLE(USART)   SET_BIT  (USART->CR2, USART_CR2_ABREN_Pos);

