TerryFogg/nfNative/Targets/ST_STM32H7B3I-DK/STM32H7B3_DK_nanoBooter/stm32h7xx_Usart.h
/*
Bits 22:21 ABRMOD[1:0]: Auto baud rate mode
These bits are set and cleared by software.
    00: Measurement of the start bit is used to detect the baud rate. 
    01: Falling edge to falling edge measurement (the received frame must start with a single bit = 1 and Frame = Start10xxxxxx)
    10: 0x7F frame detection.
    11: 0x55 frame detection
        This bitfield can only be written when ABREN = 0 or the USART is disabled (UE = 0).
        Note: If DATAINV = 1 and/or MSBFIRST = 1 the patterns must be the same on the line, for example  0xAA for MSBFIRST)
        If the USART does not support the auto baud rate feature, this bit is reserved and must be kept at reset value. 
*/
#define USART_AUTOBAUD_MODE0(USART)  CLEAR_BIT(USART->CR2, USART_CR2_ABRMODE_Pos+1);CLEAR_BIT(USART->CR2, USART_CR2_ABRMODE_Pos);
#define USART_AUTOBAUD_MODE1(USART)  CLEAR_BIT(USART->CR2, USART_CR2_ABRMODE_Pos+1);SET_BIT  (USART->CR2, USART_CR2_ABRMODE_Pos);
#define USART_AUTOBAUD_MODE2(USART)  SET_BIT  (USART->CR2, USART_CR2_ABRMODE_Pos+1);CLEAR_BIT(USART->CR2, USART_CR2_ABRMODE_Pos);    
#define USART_AUTOBAUD_MODE3(USART)  SET_BIT  (USART->CR2, USART_CR2_ABRMODE_Pos+1);SET_BIT  (USART->CR2, USART_CR2_ABRMODE_Pos);    
/*
Bit 23 RTOEN: Receiver timeout enable
    This bit is set and cleared by software.
    0: Receiver timeout feature disabled. 
    1: Receiver timeout feature enabled. 
        When this feature is enabled, the RTOF flag in the USART_ISR register is set if the RX line is idle 
        (no reception) for the duration programmed in the RTOR (receiver timeout register).
        Note: If the USART does not support the Receiver timeout feature, this bit is reserved and must be kept at reset value
*/                                               
#define USART_RECEIVER_TIMEOUT_DISABLE(USART)  CLEAR_BIT(USART->CR2, USART_CR2_RTOEN_Pos);     
#define USART_RECEIVER_TIMEOUT_ENABLE(USART)   SET_BIT  (USART->CR2, USART_CR2_RTOEN_Pos);
/*
Bits 31:24 ADD[7:0]: Address of the USART node ADD[7:4]: 
    These bits give the address of the USART node or a character code to be recognized.
    They are used to wake up the MCU with 7-bit address mark detection in multiprocessor 
    communication during Mute mode or low-power mode. The MSB of the character sent by the 
    transmitter should be equal to 1. They can also be used for character detection during normal 
    reception, Mute mode inactive (for example, end of block detection in ModBus protocol). In this 
    case, the whole received character (8-bit) is compared to the ADD[7:0] value and CMF flag is set on 
    match.
    These bits can only be written when reception is disabled (RE = 0) or the USART is disabled (UE = 0).
    ADD[3:0]:
    These bits give the address of the USART node or a character code to be recognized.
    They are used for wakeup with address mark detection, in multiprocessor communication during 
    Mute mode or low-power mode.
    These bits can only be written when reception is disabled (RE = 0) or the USART is disabled (UE = 0).
*/

#define USART_NODE_ADDRESS  SET_BITS()

/*
Bit 0 EIE: Error interrupt enable
    Error Interrupt Enable Bit is required to enable interrupt generation in case of a framing 
    error, overrun error noise flag or SPI slave underrun error (FE = 1 or ORE = 1 or NE = 1 or UDR = 1 in the USART_ISR register).
    0: Interrupt inhibited
    1: interrupt generated when 
*/
#define USART_ERROR_INTERRUPT_DISABLE(USART) CLEAR_BIT(USART->CR3, USART_CR3_EIE_Pos);       
#define USART_ERROR_INTERRUPT_ENABLE(USART)  SET_BIT  (USART->CR3, USART_CR3_EIE_Pos);
/*
Bit 1 IREN: IrDA mode enable
    This bit is set and cleared by software.
    0: IrDA disabled
    1: IrDA enabled
        This bit can only be written when the USART is disabled (UE = 0).
        Note: If IrDA mode is not supported, this bit is reserved and must be kept at reset value. 
*/                                               
#define IRDA_MODE_DISABLE(USART)  CLEAR_BIT(USART->CR3, USART_CR3_IREN_Pos);      
#define IRDA_MODE_ENABLE(USART)  SET_BIT   (USART->CR3, USART_CR3_IREN_Pos);
/*
Bit 2 IRLP: IrDA low-power
    This bit is used for selecting between normal and low-power IrDA modes
    0: Normal mode
    1: Low-power mode
        This bit can only be written when the USART is disabled (UE = 0).
        Note: If IrDA mode is not supported, this bit is reserved and must be kept at reset value
*/                                               
#define IRDA_POWER_NORMAL(USART) CLEAR_BIT(USART->CR3, USART_CR3_IRLP_Pos);      
#define IRDA_POWER_LOW(USART)    SET_BIT  (USART->CR3, USART_CR3_IRLP_Pos);
/*
Bit 3 HDSEL: Half-duplex selection
    Selection of Single-wire Half-duplex mode 
    0: Half duplex mode is not selected
    1: Half duplex mode is selected 
        This bit can only be written when the USART is disabled (UE = 0).    
*/                                               
#define USART_NORMAL_DUPLEX(USART)  CLEAR_BIT(USART->CR3, USART_CR3_HDSEL_Pos);     
#define USART_HALF_DUPLEX(USART)    SET_BIT  (USART->CR3, USART_CR3_HDSEL_Pos);
/*
Bit 4 NACK: Smartcard NACK enable
    0: NACK transmission in case of parity error is disabled
    1: NACK transmission during parity error is enabled
        This bitfield can only be written when the USART is disabled (UE = 0).
        Note: If the USART does not support Smartcard mode, this bit is reserved and must be kept at reset value. 
*/                                               
#define SMARTCARD_NACK_PE_DISABLE(USART)  CLEAR_BIT(USART->CR3, USART_CR3_NACK_Pos);      
#define SMARTCARD_NACK_PE_ENABLE(USART)   SET_BIT  (USART->CR3, USART_CR3_NACK_Pos);
/*
Bit 5 SCEN: Smartcard mode enable
    This bit is used for enabling Smartcard mode.
    0: Smartcard Mode disabled
    1: Smartcard Mode enabled
        This bitfield can only be written when the USART is disabled (UE = 0).
        Note: If the USART does not support Smartcard mode, this bit is reserved and must be kept at reset value. 
*/                                               
#define SMARTCARD_MODE_DISABLE(USART)  CLEAR_BIT(USART->CR3, USART_CR3_SCEN_Pos);      
#define SMARTCARD_MODE_ENABLE(USART)   SET_BIT  (USART->CR3, USART_CR3_SCEN_Pos);
/*
Bit 6 DMAR: DMA enable receiver
    This bit is set/reset by software
    0: DMA mode is disabled for reception
    1: DMA mode is enabled for reception
*/                                               
#define USART_DMA_RECEIVER_DISABLE(USART)  CLEAR_BIT(USART->CR3, USART_CR3_DMAR_Pos);      
#define USART_DMA_RECEIVER_ENABLE(USART)   SET_BIT  (USART->CR3, USART_CR3_DMAR_Pos);
/*
Bit 7 DMAT: DMA enable transmitter
    This bit is set/reset by software
    1: DMA mode is enabled for transmission
    0: DMA mode is disabled for transmission
*/                                               
#define USART_DMA_TRANSMITTER_DISABLE(USART)  CLEAR_BIT(USART->CR3, USART_CR3_DMAT_Pos);      
#define USART_DMA_TRANSMITTER_ENABLE(USART)   SET_BIT  (USART->CR3, USART_CR3_DMAT_Pos);
/*
Bit 8 RTSE: RTS enable
    0: RTS hardware flow control disabled
    1: RTS output enabled, data is only requested when there is space in the receive buffer. The 
    transmission of data is expected to cease after the current character has been transmitted. 
    The nRTS output is asserted (pulled to 0) when data can be received.
    This bit can only be written when the USART is disabled (UE = 0).
    Note: If the hardware flow control feature is not supported, this bit is reserved and must be kept at reset value
*/
#define USART_RTS_DISABLE(USART) CLEAR_BIT(USART->CR3, USART_CR3_RTSE_Pos);      
#define USART_RTS_ENABLE(USART)  SET_BIT  (USART->CR3, USART_CR3_RTSE_Pos);
/*
Bit 9 CTSE: CTS enable
    0: CTS hardware flow control disabled
    1: CTS mode enabled, data is only transmitted when the nCTS input is asserted (tied to 0). 
    If the nCTS input is deasserted while data is being transmitted, then the transmission is 
    completed before stopping. If data is written into the data register while nCTS is asserted, 
    the transmission is postponed until nCTS is asserted.
    This bit can only be written when the USART is disabled (UE = 0)
    Note: If the hardware flow control feature is not supported, this bit is reserved and must be kept at reset value. 
*/                                               
#define USART_CTS_DISABLE(USART)   CLEAR_BIT(USART->CR3, USART_CR3_CTSE_Pos);      
#define USART_CTS_ENABLE(USART)    SET_BIT  (USART->CR3, USART_CR3_CTSE_Pos);
/*
Bit 10 CTSIE: CTS interrupt enable
    0: Interrupt is inhibited
    1: An interrupt is generated whenever CTSIF = 1 in the USART_ISR register
    Note: If the hardware flow control feature is not supported, this bit is reserved and must be kept at reset value. 
*/                                               
#define USART_CTS_INTERRUPT_DISABLE(USART)  CLEAR_BIT(USART->CR3, USART_CR3_CTSIE_Pos);     
#define USART_CTS_INTERRUPT_ENABLE(USART)   SET_BIT  (USART->CR3, USART_CR3_CTSIE_Pos);
/*
Bit 11 ONEBIT: One sample bit method enable
    This bit enables the user to select the sample method. When the one sample bit method is 
    selected the noise detection flag (NE) is disabled.
    0: Three sample bit method
    1: One sample bit method
        This bit can only be written when the USART is disabled (UE = 0).
*/                                               
#define USART_THREE_SAMPLE_BIT(USART)  CLEAR_BIT(USART->CR3, USART_CR3_ONEBIT_Pos);    
#define USART_ONE_SAMPLE_BIT(USART)    SET_BIT  (USART->CR3, USART_CR3_ONEBIT_Pos);
/*
Bit 12 OVRDIS: Overrun Disable
This bit is used to disable the receive overrun detection. 
    0: Overrun Error Flag, ORE, is set when received data is not read before receiving new data. 
    1: Overrun functionality is disabled. If new data is received while the RXNE flag is still set
    the ORE flag is not set and the new received data overwrites the previous content of the 
    USART_RDR register. When FIFO mode is enabled, the RXFIFO is bypassed and data is 
    written directly in USART_RDR register. Even when FIFO management is enabled, the RXNE flag is to be used.
        This bit can only be written when the USART is disabled (UE = 0).
        Note: This control bit enables checking the communication flow w/o reading the data
*/                                               
#define USART_OVERRUN_ERROR_FLAG_ENABLE(USART)   CLEAR_BIT(USART->CR3, USART_CR3_OVRDIS_Pos);    
#define USART_OVERRUN_ERROR_FLAG_DISABLE(USART)   SET_BIT (USART->CR3, USART_CR3_OVRDIS_Pos);
/*
Bit 13 DDRE: DMA Disable on Reception Error
    0: DMA is not disabled in case of reception error. The corresponding error flag is set but 
    RXNE is kept 0 preventing from overrun. As a consequence, the DMA request is not asserted, 
    so the erroneous data is not transferred (no DMA request), but next correct received data is transferred (used for Smartcard mode).
    1: DMA is disabled following a reception error. The corresponding error flag is set, as well as RXNE. 
    The DMA request is masked until the error flag is cleared. This means that the software must first disable 
    the DMA request (DMAR = 0) or clear RXNE/RXFNE is case FIFO mode is enabled) before clearing the error flag.
        This bit can only be written when the USART is disabled (UE=0).
        Note: The reception errors are: parity error, framing error or noise error
*/                                               
#define USART_DMA_RECEPTION_ERROR_INTERRUPT_ENABLE(USART)   CLEAR_BIT(USART->CR3, USART_CR3_DDRE_Pos);
#define USART_DMA_RECEPTION_ERROR_INTERRUPT_DISABLE(USART)  SET_BIT  (USART->CR3, USART_CR3_DDRE_Pos);      
/*
Bit 14 DEM: Driver enable mode 
    This bit enables the user to activate the external transceiver control, through the DE signal. 
    0: DE function is disabled. 
    1: DE function is enabled. The DE signal is output on the RTS pin.
        This bit can only be written when the USART is disabled (UE = 0).
        Note: If the Driver Enable feature is not supported, this bit is reserved and must be kept at reset value. 
*/                                                                                                 
#define USART_DE_SIGNAL_DISABLE(USART)  CLEAR_BIT(USART->CR3, USART_CR3_DEM_Pos);       
#define USART_DE_SIGNAL_ENABLE(USART)   SET_BIT  (USART->CR3, USART_CR3_DEM_Pos);
/*
Bit 15 DEP: Driver enable polarity selection
    0: DE signal is active high. 
    1: DE signal is active low.
        This bit can only be written when the USART is disabled (UE = 0).
        Note: If the Driver Enable feature is not supported, this bit is reserved and must be kept at reset value. 
*/                                                                                                 
#define USART_DE_SIGNAL_ACTIVE_HIGH(USART) CLEAR_BIT(USART->CR3, USART_CR3_DEP_Pos);       
#define USART_DE_SIGNAL_ACTIVE_LOW(USART)  SET_BIT  (USART->CR3, USART_CR3_DEP_Pos);
/*
Bit 16 Reserved
    Must be kept at reset value.     
*/
/*
Bits 19:17 SCARCNT[2:0]: Smartcard auto-retry count
    This bitfield specifies the number of retries for transmission and reception in Smartcard mode.
    In transmission mode, it specifies the number of automatic retransmission retries, before 
    generating a transmission error (FE bit set).
    In reception mode, it specifies the number or erroneous reception trials, before generating a 
    reception error (RXNE/RXFNE and PE bits set).
    This bitfield must be programmed only when the USART is disabled (UE = 0).
    When the USART is enabled (UE = 1), this bitfield may only be written to 0x0, in order to 
    stop retransmission. 
        0x0: retransmission disabled - No automatic retransmission in transmit mode. 
        0x1 to 0x7: number of automatic retransmission attempts (before signaling error)
        Note: If Smartcard mode is not supported, this bit is reserved and must be kept at reset value.
*/
#define USART_SCARCNT(USART)  (Doco:BITS_17,18,19)
/*
Bits 21:20 WUS[1:0]: Wakeup from low-power mode interrupt flag selection
    This bitfield specifies the event which activates the WUF (Wakeup from low-power mode flag). 
    00: WUF active on address match (as defined by ADD[7:0] and ADDM7)
    01: Reserved.
    10: WUF active on start bit detection
    11: WUF active on RXNE/RXFNE. 
        This bitfield can only be written when the USART is disabled (UE = 0).
        If the USART does not support the wakeup from Stop feature, this bit is reserved and must be kept at reset value
*/
#define USART_WAKEUP_ON_ADDRESS_MATCH(USART)     CLEAR_BIT(USART->CR3, USART_CR3_WUS_Pos);CLEAR_BIT(USART->CR3, USART_CR3_WUS_Pos);
#define USART_WAKEUP_ON_DETECT_START_BIT(USART)  SET_BIT  (USART->CR3, USART_CR3_WUS_Pos);CLEAR_BIT(USART->CR3, USART_CR3_WUS_Pos);
#define USART_WAKEUP_ON_RXNE_RXFNE(USART)        SET_BIT  (USART->CR3, USART_CR3_WUS_Pos);SET_BIT  (USART->CR3, USART_CR3_WUS_Pos);       
/*
Bit 22 WUFIE: Wakeup from low-power mode interrupt enable
    This bit is set and cleared by software.
    0: Interrupt inhibited
    1: USART interrupt generated whenever WUF = 1 in the USART_ISR register
        Note: WUFIE must be set before entering in low-power mode.
        The WUF interrupt is active only in low-power mode.
        If the USART does not support the wakeup from Stop feature, this bit is reserved and must be kept at reset value
*/
#define USART_WAKEUP_DISABLE(USART) CLEAR_BIT(USART->CR3, USART_CR3_WUFIE_Pos);       
#define USART_WAKEUP_ENABLE(USART)  SET_BIT(USART->CR3, USART_CR3_WUFIE_Pos);
/*
Bit 23 TXFTIE: TXFIFO threshold interrupt enable
    This bit is set and cleared by software.
    0: Interrupt inhibited
    1: USART interrupt generated when TXFIFO reaches the threshold programmed in TXFTCFG
*/       
#define USART_TXFIFO_THESHOLD_INTERRUPT_DISABLE(USART)  CLEAR_BIT(USART->CR3, USART_CR3_TXFTIE_Pos);       
#define USART_TXFIFO_THESHOLD_INTERRUPT_ENABLE(USART)   SET_BIT(USART->CR3, USART_CR3_TXFTIE_Pos);
/*
Bit 24 TCBGTIE: Transmission Complete before guard time, interrupt enable
    This bit is set and cleared by software.
    0: Interrupt inhibited
    1: USART interrupt generated whenever TCBGT=1 in the USART_ISR register
        Note: If the USART does not support the Smartcard mode, this bit is reserved and must be kept at reset value. 
*/                                                                                                                  
#define USART_TX_COMPLETE_GUARD_TIME_INTERRUPT_DISABLE(USART) CLEAR_BIT(USART->CR3, USART_CR3_TCBGTIE_Pos);       
#define USART_TX_COMPLETE_GUARD_TIME_INTERRUPT_ENABLE(USART)  SET_BIT(USART->CR3, USART_CR3_TCBGTIE_Pos);
/*
Bits 27:25 RXFTCFG[2:0]: Receive FIFO threshold configuration
    000:Receive FIFO reaches 1/8 of its depth
    001:Receive FIFO reaches 1/4 of its depth
    010:Receive FIFO reaches 1/2 of its depth
    011:Receive FIFO reaches 3/4 of its depth
    100:Receive FIFO reaches 7/8 of its depth
    101:Receive FIFO becomes full
        Remaining combinations: Reserved
*/
#define USART_RXFIFO_THRESHOLD_1_8(USART) MODIFY_REG(USART->CR3, USART_CR3_RXFTCFG ,UART_RXFIFO_THRESHOLD_1_8 )
#define USART_RXFIFO_THRESHOLD_1_4(USART) MODIFY_REG(USART->CR3, USART_CR3_RXFTCFG ,UART_RXFIFO_THRESHOLD_1_4 )
#define USART_RXFIFO_THRESHOLD_1_2(USART) MODIFY_REG(USART->CR3, USART_CR3_RXFTCFG ,UART_RXFIFO_THRESHOLD_1_2 )
#define USART_RXFIFO_THRESHOLD_3_4(USART) MODIFY_REG(USART->CR3, USART_CR3_RXFTCFG ,UART_RXFIFO_THRESHOLD_3_4 )
#define USART_RXFIFO_THRESHOLD_7_8(USART) MODIFY_REG(USART->CR3, USART_CR3_RXFTCFG ,UART_RXFIFO_THRESHOLD_7_8 )
#define USART_RXFIFO_THRESHOLD_8_8(USART) MODIFY_REG(USART->CR3, USART_CR3_RXFTCFG ,UART_RXFIFO_THRESHOLD_8_8 )

/*
Bit 28 RXFTIE: RXFIFO threshold interrupt enable
    This bit is set and cleared by software.
    0: Interrupt inhibited
    1: USART interrupt generated when Receive FIFO reaches the threshold programmed in RXFTCFG
*/
#define USART_RXFIFO_THESHOLD_INTERRUPT_DISABLE(USART) CLEAR_BIT(USART->CR3, USART_CR3_RXFTIE_Pos);       
#define USART_RXFIFO_THESHOLD_INTERRUPT_ENABLE(USART)  SET_BIT(USART->CR3, USART_CR3_RXFTIE_Pos);

/*
Bits 31:29 TXFTCFG[2:0]: TXFIFO threshold configuration
000:TXFIFO reaches 1/8 of its depth
001:TXFIFO reaches 1/4 of its depth
010:TXFIFO reaches 1/2 of its depth
011:TXFIFO reaches 3/4 of its depth
100:TXFIFO reaches 7/8 of its depth
101:TXFIFO becomes empty
Remaining combinations: Reserved
*/
#define USART_TXFIFO_THRESHOLD_1_8(USART) MODIFY_REG(USART->CR3, USART_CR3_TXFTCFG ,UART_TXFIFO_THRESHOLD_1_8 )
#define USART_TXFIFO_THRESHOLD_1_4(USART) MODIFY_REG(USART->CR3, USART_CR3_TXFTCFG ,UART_TXFIFO_THRESHOLD_1_4 )
#define USART_TXFIFO_THRESHOLD_1_2(USART) MODIFY_REG(USART->CR3, USART_CR3_TXFTCFG ,UART_TXFIFO_THRESHOLD_1_2 )
#define USART_TXFIFO_THRESHOLD_3_4(USART) MODIFY_REG(USART->CR3, USART_CR3_TXFTCFG ,UART_TXFIFO_THRESHOLD_3_4 )
#define USART_TXFIFO_THRESHOLD_7_8(USART) MODIFY_REG(USART->CR3, USART_CR3_TXFTCFG ,UART_TXFIFO_THRESHOLD_7_8 )
#define USART_TXFIFO_THRESHOLD_8_8(USART) MODIFY_REG(USART->CR3, USART_CR3_TXFTCFG ,UART_TXFIFO_THRESHOLD_8_8 )


    
  

